pkg/fixtures/triggers/checkout.session.completed.json

{
  "_meta": {
    "template_version": 0
  },
  "fixtures": [
    {
      "name": "checkout_session",
      "path": "/v1/checkout/sessions",
      "method": "post",
      "params": {
        "success_url": "https://httpbin.org/post",
        "cancel_url": "https://httpbin.org/post",
        "payment_method_types": ["card"],
        "line_items": [
          {
            "name": "t-shirt",
            "description": "comfortable cotton t-shirt",
            "amount": 1500,
            "currency": "usd",
            "quantity": 2
          }
        ],
        "payment_intent_data": {
          "shipping": {
            "name": "Jenny Rosen",
            "address": {
              "line1": "510 Townsend St",
              "postal_code": "94103",
              "city": "San Francisco",
              "state": "CA",
              "country": "US"
            }
          }
        }
      }
    },
    {
      "name": "payment_page",
      "path": "/v1/payment_pages/${checkout_session:id}",
      "method": "get"
    },
    {
      "name": "payment_method",
      "path": "/v1/payment_methods",
      "method": "post",
      "params": {
        "type": "card",
        "card": {
          "token": "tok_visa"
        },
        "billing_details": {
          "email": "stripe@example.com"
        }
      }
    },
    {
      "name": "payment_page_confirm",
      "path": "/v1/payment_pages/${checkout_session:id}/confirm",
      "method": "post",
      "params": {
        "payment_method": "${payment_method:id}",
        "expected_amount": 3000
      }
    }
  ]
}
